// Licensor and License view strings
"LICENSE" = "Thank you for using BBEdit!";
"UNKNOWN_LICENSEE" = "BBEdit License Information";
"DEMO_LAST_DAY" = "BBEdit will enter Free Mode within 24 hours.";
"DEMO_REMAINDER_FORMAT" = "There are %i %@ remaining before BBEdit enters Free Mode.";
"DEMO_EXPIRED" = "BBEdit is in Free Mode.";
"DEMO_EXPIRED_EXPLANATION" = "Thank you for using BBEdit! The command you have chosen is not available in Free Mode. To make this command available again, please purchase or enter a license code for this version.";
"DEMO_EXPIRED_EXPLANATION_APPSTORE" = "Thank you for using BBEdit! The command you have chosen is not available in Free Mode. To make this command available again, please purchase a subscription.";

UPGRADE_ELIGIBLE_MAIN = "You have a license code for a previous BBEdit version.";

UPGRADE_ELIGIBLE_INFO = "You may be eligible to purchase an upgrade to this version of BBEdit at a discounted price.\n\nYour previous version serial number is:\n\n%@";

// Splash view strings
"DEMO_MESSAGE" = "Thank you for using BBEdit!";

"DEMO_DESCRIPTION_FORMAT_FIRST_RUN" = "BBEdit will enter Free Mode in %i %@.\n\nUntil then, you can use all of BBEdit’s features.\n\nOnce BBEdit enters Free Mode, you are welcome to keep using it for free, forever, but some of its advanced features will no longer be available. You will be able to activate BBEdit’s advanced features at any time with a valid license code for this version of BBEdit.\n\nIf you already have a license code for this version of BBEdit, click the “Enter License” button.";

"DEMO_DESCRIPTION_FORMAT_EXPIRED" = "BBEdit is running in Free Mode.\n\nYou are welcome to keep using it for free, forever, but some of its advanced features are no longer available. You can activate BBEdit’s advanced features at any time with a valid license code for this version of BBEdit.\n\nIf you already have a license code for this version of BBEdit, click the “Enter License” button.\n\nTo purchase a BBEdit license, click the “Buy License…” button below. To learn more about BBEdit, click the “Product Info…” button.";

"DEMO_SPLASH_LAST_DAY" = "BBEdit will enter Free Mode within 24 hours. Until then, you can use all of BBEdit’s features.\n\nOnce BBEdit enters Free Mode, you are welcome to keep using it for free, forever, but some of its advanced features will no longer be available. You will be able to activate BBEdit’s advanced features at any time with a valid license code for this version of BBEdit.\n\nTo purchase a BBEdit license, click the “Buy License…” button below. If you already have a license code for this version of BBEdit, click the “Enter License…” button. To learn more about BBEdit, click the “Product Info…” button.";

"DEMO_DESCRIPTION_FORMAT_APPSTORE_FIRST_RUN" = "BBEdit will enter Free Mode in %i %@.\n\nWhen that happens, you are welcome to keep using BBEdit for free, forever, but some of its advanced features will no longer be available. You will be able to activate BBEdit’s advanced features at any time with an active subscription.\n\nIf you already have an active subscription, click the “Restore Purchases” button.";

"DEMO_DESCRIPTION_FORMAT_APPSTORE_EXPIRED" = "BBEdit is running in Free Mode.\n\nYou are welcome to keep using it for free, forever, but some of its advanced features are no longer available. You can activate BBEdit’s advanced features at any time with an active subscription.\n\nIf you already have an active subscription, click the “Restore Purchases” button.\n\nTo purchase a BBEdit subscription, click the “Buy Subscription…” button below.";

"DEMO_SPLASH_LAST_DAY_APPSTORE" = "BBEdit will enter Free Mode within 24 hours. Until then, you can use all of BBEdit’s features.\n\nOnce BBEdit enters Free Mode, you are welcome to keep using it for free, forever, but some of its advanced features will no longer be available. You will be able to activate BBEdit’s advanced features at any time with an active subscription.\n\nTo purchase a BBEdit subscription, click the “Buy Subscription…” button below. If you already have an active subscription, click the “Restore Purchases” button.";

"APPSTORE_SUBSCRIPTION_PROMPT" = "An active subscription gives you access to all of BBEdit’s advanced features, including any new features that we introduce during updates or major upgrades, for as long as the subscription is in good standing.\n\nPlease see our $COMPARISON for a detailed listing of which advanced features are available with a subscription.\n\nWe do not collect any data from your use of BBEdit, whether or not a subscription is in effect.\n\nYour interactions with BBEdit are protected by our $PRIVACY_POLICY.\n\nYour use of BBEdit is governed by the terms of the $LICENSE.\n\nWhen you purchase a subscription, payment will be charged to your Apple ID Account upon confirmation of purchase.\n\nYour subscription will renew automatically, unless you cancel your subscription at least 24 hours prior to the end of the currently active subscription period. Your Apple ID Account will be charged for the renewal within 24 hours prior to the end of the currently active subscription period, and your account history will reflect the cost of the renewal.\n\nYou can manage your subscription and cancel automatic renewal by going to your $MANAGEMENT after purchase.\n\nPurchasing a subscription will permanently end your evaluation period, and forfeits any unused portion of the evaluation period, if applicable.";

"APPSTORE_COMPARISON_LINK" = "comparison chart";
"APPSTORE_PRIVACY_LINK" = "privacy policy";
"APPSTORE_LICENSE_LINK" = "end-user license for Mac App Store customers";
"APPSTORE_MANAGEMENT_LINK" = "Manage Subscriptions";

// Enter license sheet
"SERIAL_HINT_FORMAT" = "Your serial number begins with “%s”, and is of the form “%s-ABCDE-DEFGH-IJKLM”.";
"OLD_SERIAL_NUMBER_WARNING" = "This serial number is from an older version of BBEdit, and cannot be used with this version.";
"INVALID_SERIAL_NUMBER_WARNING" = "This serial number is not usable. It may be incomplete, mistyped, or for a different product.";
"SERIAL_NUMBER_TOO_NEW_WARNING" = "This serial number is for a newer version of BBEdit, and cannot be used with this version.";

// button titles
"ENTER_LICENSE" = "Enter License…";
"EDIT_LICENSE" = "Edit License…";
"LICENSOR_CONTINUE_EXPIRED" = "Continue";
"LICENSOR_USE_DEMO" = "Continue";

//	Expired-demo startup alert
"DEMO_EXPIRED_MAIN" = "Your BBEdit evaluation period has ended.";
"DEMO_EXPIRED_SUB" = "Thank you for trying BBEdit!\n\nMenu commands labeled with a star will no longer be available. If you would like to continue using those commands, please purchase or enter a license code for this version.";

"DEMO_EXPIRED_SUB_APPSTORE" = "Thank you for trying BBEdit!\n\nMenu commands labeled with a star will no longer be available. If you would like to continue using those commands, please purchase a subscription.";

"DEMO_EXPIRED_BUY" = "Buy License…";
"DEMO_EXPIRED_BUY_APPSTORE" = "Buy Subscription…";
"DEMO_EXPIRED_ENTER" = "Enter License…";
"DEMO_EXPIRED_CONTINUE" = "Continue";

"DEMO_PERIOD_RESET" = "The version of BBEdit you are currently using includes significant changes from previous versions, so we have restarted your evaluation period.";
"DEMO_PERIOD_RESET_SUB" = "You have a full 30 days in which to try out the new features and refinements.\n\nAll of BBEdit’s advanced features are available for the duration of the evaluation, and then BBEdit will enter Free Mode.\n\nIf you were using BBEdit in Free Mode before, or were in the middle of an evaluation period, you don’t have to do anything.";
"DEMO_PERIOD_MORE_INFO" = "More Info";

"SUBSCRIPTION_ACTIVE" = "You have an active subscription.";
"SUBSCRIPTION_DETAILS" = "Subscription type: %@\nExpires: %@\n\nYour subscription will renew automatically.";
"C10E7FDDA3FE2D4434A81D97F64A0EA1A6B1DFB5" = "Annual";
"86A6104B36FB493CFE274147AA72D33BD48434EA" = "Monthly";

"WAITING_FOR_APP_STORE" = "Waiting for the App Store…";
"WAITING_FOR_RECEIPT" = "(refreshing receipt data)";

"RESTORE_PURCHASES" = "Restore Purchases";
"MANAGE_SUBSCRIPTION" = "Manage…";

"APPSTORE_PROGRESS_RESTORING" = "Restoring purchases…";
"APPSTORE_PROGRESS_FETCHING_PRODUCT_LIST" = "Getting product list…";
"APPSTORE_PROGRESS_COMPLETING" = "Completing your purchase…";

"APPSTORE_BUILD_HAS_SERIAL_NUMBER_MAIN" = "You appear to have a license code for this version of BBEdit.";
"APPSTORE_BUILD_HAS_SERIAL_NUMBER_INFO" = "The Mac App Store version of BBEdit cannot use your license code.\n\nA valid license allows access to all of BBEdit’s features, but you must instead download, install, and use the version of BBEdit available on our web site.\n\nFor additional details and instructions, use the “More Info” button.";
"APPSTORE_BUILD_HAS_SERIAL_NUMBER_OK" = "More Info";
"APPSTORE_BUILD_HAS_SERIAL_NUMBER_CANCEL" = "Continue";
